package com.example.im_yong_second;

import static com.example.im_yong_second.SubjectInfo.*;

public class Cont_2nd_00_Local_Policy {
    static void content_installing(int sc) {//subject code

        SubjectInfo.insert_into_ps(sc, "시책");

        _fb(sc, "기초가 강한 교육");
        {
            _s();
            _ip("기초학력 책임교육 강화");
            {
                _s();
                _ip("한글 책임교육 강화");
                _ip("수학 책임교육 강화");
                _ip("영어 책임교육 강화");
                _e();
            }
            _ip("기초학력 안전망 구축");
            {
                _s();
                _ip("기초학력 지원체제 활성화");
                _e();
            }
            _ip("모두가 참여하는 행복한 특수교육");
            {
                _s();
                _ip("특수교육 운영 내실화");
                _ip("특수교육 지원 확대");
                _e();
            }
            _ip("교육과정-수업-평가 혁신 확산");
            {
                _s();
                _ip("미래 핵심역량을 기르는 교육과정 혁신");
                _ip("즐거운 배움을 위한 수업 혁신");
                _ip("배움의 의미를 찾는 평가 혁신");
                _e();
            }
            _e();
        }
        _fb(sc, "미래를 여는 교실");
        {
            _s();
            _ip("미래학력을 위한 학교혁신");
            {
                _s();
                _ip("학교혁신 일반화");
                _ip("강원행복더하기 모범・거점・미래학교 운영");
                _ip("강원행복더하기유치원・특수학교 지정 운영");
                _e();
            }
            _ip("진로교육 활성화");
            {
                _s();
                _ip("진로탄력성 향상을 위한 진로교육 강화");
                _ip("활동중심 진로교육 활성화");
                _e();
            }
            _ip("강원행복고등학교 운영");
            {
                _s();
                _ip("일반고등학교 혁신");
                _ip("직업계고등학교 혁신");
                _ip("고교학점제 기반 조성 및 추진");
                _e();
            }
            _ip("민주시민·문화예술·인문교육 활성화");
            {
                _s();
                _ip("민주시민교육");
                _ip("학생생활교육");
                _ip("문화예술교육");
                _ip("독서・인문・토론교육");
                _e();
            }
            _ip("마을교육공동체 활성화");
            {
                _s();
                _ip("작은학교 희망 만들기");
                _ip("마을교육공동체 사업 내실화");
                _ip("지역사회 협력 시스템 구축");
                _ip("작은학교 희망 만들기");
                _e();
            }
            _ip("과학정보교육 활성화");
            {
                _s();
                _ip("창의융합형 과학교육 활성화");
                _ip("소프트웨어(SW)교육 활성화");
                _ip("잠재력 계발을 위한 영재교육");
                _ip("(가칭) 수리과학정보 체험센터 신설");
                _e();
            }
            _e();
        }
        _fb(sc, "건강하고 안전한 학교");
        {
            _s();
            _ip("학생 건강 증진, 놀이, 행복 급식");
            {
                _s();
                _ip("학생 건강체력을 향상하는 체육교육");
                _ip("학생의 건강한 성장을 책임지는 보건교육");
                _ip("행복한 학교생활을 위한 친환경 교육급식");
                _e();
            }
            _ip("안전하고 교육적인 학교 환경 조성");
            {
                _s();
                _ip("학생안전 시스템 구축");
                _ip("재난 안전 및 비상대비태세 확립");
                _ip("유해환경으로부터 안전한 학교");
                _ip("미래교육에 대응하는 학교공간혁신");
                _ip("학교 및 교육행정기관 급식소 근로자를 위한 안전한 근무환경 조성");
                _e();
            }
            _e();
        }
        _fb(sc, "모두에게 따듯한 교육복지");
        {
            _s();
            _ip("모든 학생을 위한 교육 안전망");
            {
                _s();
                _ip("위기학생 지원 강화를 위한 학생지원센터 운영");
                _ip("맞춤형 대안교육 지원으로 학업중단예방 지원체제 구축");
                _ip("질 높은 교육경험을 제공하는 돌봄・방과후 학교");
                _e();
            }
            _ip("돈 안드는 교육 완성");
            {
                _s();
                _ip("학부모 공교육비 부담 경담");
                _ip("학부모 사교육비 부담 경감");
                _ip("교육과정 활동비 및 활동 지원");
                _e();
            }
            _e();
        }
        _fb(sc, "사람을 위한 교육행정");
        {
            _s();
            _ip("현장중심, 교육중심 교육정책 추진");
            {
                _s();
                _ip("교원을 위한 지원 강화");
                _ip("교원 혁신 역량 강화");
                _ip("지방공무원 혁신 역량 강화");
                _ip("교육공무직 고용안정 및 효과적인 인력 운용");
                _ip("학교업무정상화 지원 강화");
                _ip("학교중심 법무행정 지원 서비스 강화");
                _e();
            }
            _ip("교육공동체 민주주의 확립");
            {
                _s();
                _ip("민주적 학교문화 정립");
                _ip("민주적 조직문화 정립");
                _ip("교원・지방공무원・교육공무직 단체와 협력적 노사관계 구축");
                _ip("사립학교 공공성 확립");
                _ip("상시적 교육정책 의견 수렴");
                _ip("적극적인 교육 홍보 활동 전개");
                _e();
            }
            _ip("교육행정 선진화");
            {
                _s();
                _ip("직속기관 역할・기능 재구조화");
                _ip("깨끗하고 공정한 청정 교육행정");
                _ip("안전하고 편리한 교육정보서비스 제공");
                _ip("교육공동체 중심의 열린 교육행정");
                _e();
            }
            _e();
        }
    }
}
